app/controllers/manager_controller.rb

  def index
    @sections = Section.paginate :page => params[:page], :per_page => 15
---
SELECT * FROM `sections` LIMIT 0, 15