app/controllers/pages_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`id` = 2)
---
  def show
    @page = Page.find(params[:id])