app/controllers/pages_controller.rb

  def edit
    @page   = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 2)

  def create
    @pageable = find_pageable

    logger.info @pageable.inspect

    @page     = @pageable.pages.build(params[:page])

    respond_to do |format|
      if @page.save
        flash[:success] = 'Page was successfully created.'
        format.html { redirect_to (@page.uploads.count >= 1) ? edit_page_path(@page) : sections_path }
---
INSERT INTO `pages` (`created_at`, `title`, `body`, `section_id`, `updated_at`, `subsection_id`) VALUES('2009-08-19 03:07:50', 'Page IV', 'This is the body of my page 4.', '1', '2009-08-19 03:07:50', NULL)
SELECT * FROM `pages` ORDER BY pages.id DESC LIMIT 1

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 3)
UPDATE `pages` SET `updated_at` = '2009-08-18 22:15:31', `body` = 'this is my great body from page 2.' WHERE `id` = 3

  def destroy
    @page       = Page.find(params[:id])
    @page.destroy
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 3)
DELETE FROM `pages` WHERE `id` = 3