app/controllers/sections_controller.rb

SELECT * FROM `sections` WHERE (`sections`.`id` = 1)
---
  def new_page
    @section = Section.find(params[:id])