app/controllers/sections_controller.rb

SELECT * FROM `sections` WHERE (`sections`.`id` = 1)
---
  def items
    @section = Section.find(params[:id])

SELECT * FROM `sections` WHERE (`sections`.`id` = 4)
---
  def show
    @section = Section.find(params[:id])

INSERT INTO `sections` (`name`, `created_at`, `updated_at`) VALUES('Portfolio', '2009-08-18 23:28:47', '2009-08-18 23:28:47')
---
  def create
    @section = Section.new(params[:section])

    respond_to do |format|
      if @section.save