app/controllers/subsections_controller.rb

  def show
    @subsection = Subsection.find(params[:id])
---
SELECT * FROM `subsections` WHERE (`subsections`.`id` = 3)

  def items
    @subsection = Subsection.find(params[:id])
---
SELECT * FROM `subsections` WHERE (`subsections`.`id` = 1)

  def new_page
    @subsection = Subsection.find(params[:id])
---
SELECT * FROM `subsections` WHERE (`subsections`.`id` = 1)

  def create
    @subsection = Subsection.new(params[:subsection])

    respond_to do |format|
      if @subsection.save
---
INSERT INTO `subsections` (`name`, `created_at`, `section_id`, `updated_at`) VALUES('Subsection II', '2009-08-19 00:44:07', NULL, '2009-08-19 00:44:07')